Tekla Open API Reference for Tekla Structures 2025
PolyBeam.AddContourPoint Method
 Adds a contour point to the polybeam.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool AddContourPoint(
	ContourPoint contourPoint
)
Public Function AddContourPoint (
	contourPoint As ContourPoint
) As Boolean
Parameters
contourPoint
Type: Tekla.Structures.Model.ContourPoint
The contour point to be added to the polybeam.
Return Value
Type: Boolean
True on success, false if there is no more space for another contour point.
See Also
Reference
PolyBeam Class
Tekla.Structures.Model Namespace